haliboteda/open_plc_arduino/variants/STM32H7xx/H743/variant_PLC_H743.h
/*
 *******************************************************************************
 * Copyright (c) 2020, STMicroelectronics
 * All rights reserved.
 *
 * This software component is licensed by ST under BSD 3-Clause license,
 * the "License"; You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                        opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */
#pragma once

/*----------------------------------------------------------------------------
 *        STM32 pins number
 *----------------------------------------------------------------------------*/
#define PA0                     PIN_A0
#define PA1                     PIN_A1
#define PA2                     PIN_A2
#define PA3                     PIN_A3
#define PA4                     PIN_A4
#define PA5                     PIN_A5
#define PA6                     PIN_A6
#define PA7                     PIN_A7
#define PA8                     8
#define PA9                     9
#define PA10                    10
#define PA11                    11
#define PA12                    12
#define PA13                    13
#define PA14                    14
#define PA15                    15
#define PB0                     PIN_A8
#define PB1                     PIN_A9
#define PB2                     18
#define PB3                     19
#define PB4                     20
#define PB5                     21
#define PB6                     22
#define PB7                     23
#define PB8                     24
#define PB9                     25
#define PB10                    26
#define PB11                    27
#define PB12                    28
#define PB13                    29
#define PB14                    30
#define PB15                    31
#define PC0                     PIN_A10
#define PC1                     PIN_A11
#define PC4                     PIN_A12
#define PC5                     PIN_A13
#define PC6                     36
#define PC7                     37
#define PC8                     38
#define PC9                     39
#define PC10                    40
#define PC11                    41
#define PC12                    42
#define PC13                    43
#define PC14                    44
#define PC15                    45
#define PD0                     46
#define PD1                     47
#define PD2                     48
#define PD3                     49
#define PD4                     50
#define PD5                     51
#define PD6                     52
#define PD7                     53
#define PD8                     54
#define PD9                     55
#define PD10                    56
#define PD11                    57
#define PD12                    58
#define PD13                    59
#define PD14                    60
#define PD15                    61
#define PE0                     62
#define PE1                     63
#define PE2                     64
#define PE3                     65
#define PE4                     66
#define PE5                     67
#define PE6                     68
#define PE7                     69
#define PE8                     70
#define PE9                     71
#define PE10                    72
#define PE11                    73
#define PE12                    74
#define PE13                    75
#define PE14                    76
#define PE15                    77
#define PF0                     78
#define PF1                     79
#define PF2                     80
#define PF3                     PIN_A14
#define PF4                     PIN_A15
#define PF5                     PIN_A16
#define PF6                     PIN_A17
#define PF7                     PIN_A18
#define PF8                     PIN_A19
#define PF9                     PIN_A20
#define PF10                    PIN_A21
#define PF11                    PIN_A22
#define PF12                    PIN_A23
#define PF13                    PIN_A24
#define PF14                    PIN_A25
#define PF15                    93
#define PG0                     94
#define PG1                     95
#define PG2                     96
#define PG3                     97
#define PG4                     98
#define PG5                     99
#define PG6                     100
#define PG7                     101
#define PG8                     102
#define PG9                     103
#define PG10                    104
#define PG11                    105
#define PG12                    106
#define PG13                    107
#define PG14                    108
#define PG15                    109
#define PH0                     110
#define PH1                     111
#define PH2                     PIN_A26
#define PH3                     PIN_A27
#define PH4                     PIN_A28
#define PH5                     PIN_A29
#define PH6                     116
#define PH7                     117
#define PH8                     118
#define PH9                     119
#define PH10                    120
#define PH11                    121
#define PH12                    122
#define PH13                    123
#define PH14                    124
#define PH15                    125
#define PI0                     126
#define PI1                     127
#define PI2                     128
#define PI3                     129
#define PI4                     130
#define PI5                     131
#define PI6                     132
#define PI7                     133
#define PI8                     134
#define PI9                     135
#define PI10                    136
#define PI11                    137
#define PC2_C                   PIN_A30
#define PC3_C                   PIN_A31

/*----------------------------------------------------------------------------
 * OpenPLC Bridge MPU  -  hardware-signal aliases
 *
 * Sources (Production/ folder):
 *   Bridge/1436_01_SCHAE-BR.pdf          Bridge MPU schematic (STM32H743IIK6)
 *   LowerDeck/Schematics/OpenPLC_LowerDeck_R3.pdf
 *   UpperDeck/Schematics/OpenPLC_UpperDeck_R3.pdf
 *   JunctionLink/Schematics/1434_01_SCHAE-JL.pdf
 *----------------------------------------------------------------------------*/

/* Dual-pad ADC3 pins - direct internal path, better accuracy than normal GPIO */
#ifndef PC2_C
#  define PC2_C   PIN_A30   /* PC2_C - ADC3_INP0 (D138) */
#endif
#ifndef PC3_C
#  define PC3_C   PIN_A31   /* PC3_C - ADC3_INP1 (D139) */
#endif

/*-------- RELAY OUTPUTS - Lower Deck Klemmblock B -------------------------*/
/* Coil drive, active-high (GPIO_PIN_SET = relay closed)                     */
/* Terminals: B01/B02=REL_1  B03/B04=REL_2  ...  B11/B12=REL_6             */
#define REL_1   PI8    /* RELAIS_1                                           */
#define REL_2   PI10   /* RELAIS_2                                           */
#define REL_3   PI11   /* RELAIS_3                                           */
#define REL_4   PG7    /* RELAIS_4                                           */
#define REL_5   PG3    /* RELAIS_5                                           */
#define REL_6   PD3    /* RELAIS_6                                           */

