haliboteda/open_plc_arduino/variants/STM32H7xx/H743/variant_PLC_H743.h
#define REL_OUTA   1   /* coil-A polarity (active-high)                     */
#define REL_OUTB   0   /* coil-B polarity                                   */

/*-------- DIGITAL OUTPUTS - Lower Deck Klemmblock A (high-side FETs) ------*/
/* All PWM-capable via hardware timers (see timer AF column)                 */
/* Active-high: HIGH = FET on = load powered                                 */
/* Terminals: A03=DO1  A04=DO2  ...  A10=DO8                                */
#define DOUT_1  PB13   /* High-side FET 1 - TIM1_CH1N  (PWM)               */
#define DOUT_2  PB0    /* High-side FET 2 - TIM1_CH2N  (PWM)               */
#define DOUT_3  PH15   /* High-side FET 3 - TIM8_CH3N  (PWM)               */
#define DOUT_4  PE4    /* High-side FET 4 - TIM15_CH1N (PWM)               */
#define DOUT_5  PA8    /* High-side FET 5 - TIM1_CH1   (PWM)               */
#define DOUT_6  PA9    /* High-side FET 6 - TIM1_CH2   (PWM)               */
#define DOUT_7  PI7    /* High-side FET 7 - TIM8_CH3   (PWM)               */
#define DOUT_8  PE5    /* High-side FET 8 - TIM15_CH1  (PWM)               */

/*-------- DIGITAL INPUTS - Upper Deck Klemmblock D ------------------------*/
/* All support hardware encoder counter mode (quadrature pairs noted)        */
/* Terminals: D02=DI1  D03=DI2  ...  D09=DI8                                */
#define DIN_1   PC6    /* Digital IN 1 - TIM3_CH1, encoder-1A               */
#define DIN_2   PB5    /* Digital IN 2 - TIM3_CH2, encoder-1B               */
#define DIN_3   PB6    /* Digital IN 3 - TIM4_CH1, encoder-2A               */
#define DIN_4   PB7    /* Digital IN 4 - TIM4_CH2, encoder-2B               */
#define DIN_5   PH10   /* Digital IN 5 - TIM5_CH1, encoder-3A               */
#define DIN_6   PH11   /* Digital IN 6 - TIM5_CH2, encoder-3B               */
#define DIN_7   PI5    /* Digital IN 7 - GPIO input                          */
#define DIN_8   PI6    /* Digital IN 8 - GPIO input                          */

/*-------- ANALOG INPUTS - Upper Deck Klemmblock D -------------------------*/
/* Terminals: D12=AI1  D13=AI2                                               */
#define AIN_1   PC3_C  /* Analog IN 1 - ADC3_INP1 (dual-pad direct path)   */
#define AIN_2   PA6    /* Analog IN 2 - ADC1_INP3                           */

/*-------- ANALOG OUTPUTS - Upper Deck Klemmblock D ------------------------*/
/* Terminals: D14=AO1  D15=AO2                                               */
#define AOUT_1      PA4  /* Analog OUT 1 - DAC1_OUT1                        */
#define AOUT_2      PA5  /* Analog OUT 2 - DAC1_OUT2                        */
#define AOUT_1_EF   PI4  /* Analog OUT 1 fault/enable (active-low)          */
#define AOUT_2_EF   PE3  /* Analog OUT 2 fault/enable (active-low)          */

/*-------- TEMPERATURE SENSORS - Lower Deck --------------------------------*/
#define TEMP_SCPROT  PA0  /* Short-circuit protection NTC - ADC1_INP16      */
#define TEMP_HSSW    PA3  /* High-side FET temperature NTC - ADC1_INP15     */

/*-------- KNX PROGRAMMING INTERFACE - Upper Deck --------------------------*/
/* KNX TP UART (USART1, PB14=TX AF4, PA10=RX AF7) defined in knx_config.h  */
#define KNX_PROG_KEY    PG9    /* Programming button (active-low, EXTI9_5)  */
#define KNX_PROG_LED    PG11   /* Programming LED    (active-high)          */
#define KNX_TP_OK       PD7    /* KNX bus status: HIGH = bus operational    */
#define KNX_TP_VCC_OK   PH12   /* KNX transceiver VCC OK                   */

/*-------- RS232 - Upper Deck Klemmblock C ---------------------------------*/
/* USART3 AF7 - Terminals: C05=TxD, C06=RxD                                */
#define RS232_UART_INSTANCE   3
#define RS232_TX_Pin          PC10  /* USART3_TX → terminal C05             */
#define RS232_RX_Pin          PC11  /* USART3_RX ← terminal C06             */
#define RS232_EN_Pin          PB10  /* RS232 transceiver enable (active-high)*/

/*-------- RS485 - Upper Deck Klemmblock C ---------------------------------*/
/* USART2 AF7 - Terminals: C09=RS485-A/B, C10=Direction                    */
#define RS485_UART_INSTANCE   2
#define RS485_TX_Pin          PD5   /* USART2_TX / RS485 DI                 */
#define RS485_RX_Pin          PD6   /* USART2_RX / RS485 RO                 */
#define RS485_DIR_Pin         PD4   /* RS485 direction (USART2_DE)          */

/*-------- CAN - Upper Deck Klemmblock C -----------------------------------*/
/* FDCAN1 - Terminals: C07=CAN-L, C08=CAN-H                                */
#define CAN_TX_Pin   PB9   /* FDCAN1_TX → terminal C07                     */
#define CAN_RX_Pin   PI9   /* FDCAN1_RX ← terminal C08                     */

/*-------- USB - Bridge MPU ------------------------------------------------*/
/* USB Full-Speed Device (USB-C connector)                                   */
#define USB_DM_Pin   PA11  /* USB_FS2_D_N (D-)                              */
#define USB_DP_Pin   PA12  /* USB_FS2_D_P (D+)                              */

/*-------- SD CARD - Bridge MPU (SDMMC1, 1-bit mode) ----------------------*/
#define SDMMC_CLK_Pin  PC12  /* SDMMC1_CK                                   */
#define SDMMC_CMD_Pin  PD2   /* SDMMC1_CMD                                  */
#define SDMMC_D0_Pin   PC8   /* SDMMC1_D0                                   */
#define SDMMC_CD_Pin   PE6   /* Card detect (active-low)                    */

/*-------- SPI6 - JunctionLink expansion connector -------------------------*/
/* SPI2 is the primary SPI (uses PIN_SPI_* below); SPI6 is secondary        */
#define SPI6_MOSI_Pin  PG14  /* SPI6_MOSI                                   */
#define SPI6_MISO_Pin  PB4   /* SPI6_MISO                                   */
#define SPI6_SCK_Pin   PG13  /* SPI6_SCK                                    */

/*-------- DEBUG -----------------------------------------------------------*/
#define DEBUG_TRIGGER_Pin  PC7  /* Logic-analyser trigger point             */



// Alternate pins number
#define PA0_ALT1                (PA0  | ALT1)
#define PA1_ALT1                (PA1  | ALT1)
#define PA1_ALT2                (PA1  | ALT2)
#define PA2_ALT1                (PA2  | ALT1)
#define PA2_ALT2                (PA2  | ALT2)
#define PA3_ALT1                (PA3  | ALT1)
#define PA3_ALT2                (PA3  | ALT2)
#define PA4_ALT1                (PA4  | ALT1)
#define PA4_ALT2                (PA4  | ALT2)
#define PA5_ALT1                (PA5  | ALT1)
#define PA6_ALT1                (PA6  | ALT1)
#define PA7_ALT1                (PA7  | ALT1)
#define PA7_ALT2                (PA7  | ALT2)
#define PA7_ALT3                (PA7  | ALT3)
#define PA9_ALT1                (PA9  | ALT1)
#define PA10_ALT1               (PA10 | ALT1)
#define PA11_ALT1               (PA11 | ALT1)
#define PA12_ALT1               (PA12 | ALT1)
#define PA15_ALT1               (PA15 | ALT1)
#define PA15_ALT2               (PA15 | ALT2)
#define PB0_ALT1                (PB0  | ALT1)
#define PB0_ALT2                (PB0  | ALT2)
#define PB1_ALT1                (PB1  | ALT1)
#define PB1_ALT2                (PB1  | ALT2)
#define PB3_ALT1                (PB3  | ALT1)
#define PB3_ALT2                (PB3  | ALT2)
#define PB4_ALT1                (PB4  | ALT1)
#define PB4_ALT2                (PB4  | ALT2)
#define PB5_ALT1                (PB5  | ALT1)
#define PB5_ALT2                (PB5  | ALT2)
#define PB6_ALT1                (PB6  | ALT1)
#define PB6_ALT2                (PB6  | ALT2)
#define PB7_ALT1                (PB7  | ALT1)
#define PB8_ALT1                (PB8  | ALT1)
#define PB8_ALT2                (PB8  | ALT2)
#define PB9_ALT1                (PB9  | ALT1)
#define PB9_ALT2                (PB9  | ALT2)
#define PB14_ALT1               (PB14 | ALT1)
#define PB14_ALT2               (PB14 | ALT2)
#define PB15_ALT1               (PB15 | ALT1)
#define PB15_ALT2               (PB15 | ALT2)
#define PC0_ALT1                (PC0  | ALT1)
#define PC0_ALT2                (PC0  | ALT2)
#define PC1_ALT1                (PC1  | ALT1)
#define PC1_ALT2                (PC1  | ALT2)
#define PC4_ALT1                (PC4  | ALT1)
#define PC5_ALT1                (PC5  | ALT1)
#define PC6_ALT1                (PC6  | ALT1)
#define PC6_ALT2                (PC6  | ALT2)
#define PC7_ALT1                (PC7  | ALT1)
#define PC7_ALT2                (PC7  | ALT2)
#define PC8_ALT1                (PC8  | ALT1)
#define PC9_ALT1                (PC9  | ALT1)
#define PC10_ALT1               (PC10 | ALT1)
#define PC11_ALT1               (PC11 | ALT1)
#define PF8_ALT1                (PF8  | ALT1)
#define PF9_ALT1                (PF9  | ALT1)

#define NUM_DIGITAL_PINS        140
#define NUM_DUALPAD_PINS        2
#define NUM_ANALOG_INPUTS       32

// On-board LED pin number
#ifndef LED_BUILTIN
  #define LED_BUILTIN           PNUM_NOT_DEFINED
#endif

