haliboteda/open_plc_arduino/variants/STM32H7xx/H743/variant_PLC_H743.h
// On-board user button
#ifndef USER_BTN
  #define USER_BTN              PNUM_NOT_DEFINED
#endif

// SPI definitions - SPI2 on JunctionLink expansion connector
#ifndef PIN_SPI_SS
  #define PIN_SPI_SS            PI0    /* SPI2_NSS  */
#endif
#ifndef PIN_SPI_SS1
  #define PIN_SPI_SS1           PA15
#endif
#ifndef PIN_SPI_SS2
  #define PIN_SPI_SS2           PG10
#endif
#ifndef PIN_SPI_SS3
  #define PIN_SPI_SS3           PNUM_NOT_DEFINED
#endif
#ifndef PIN_SPI_MOSI
  #define PIN_SPI_MOSI          PI3    /* SPI2_MOSI */
#endif
#ifndef PIN_SPI_MISO
  #define PIN_SPI_MISO          PC2_C  /* SPI2_MISO (dual-pad) */
#endif
#ifndef PIN_SPI_SCK
  #define PIN_SPI_SCK           PI1    /* SPI2_SCK  */
#endif

// I2C definitions - I2C2 on JunctionLink expansion connector (PH4=SCL, PH5=SDA)
#ifndef PIN_WIRE_SDA
  #define PIN_WIRE_SDA          PH5    /* I2C2_SDA (AF4) */
#endif
#ifndef PIN_WIRE_SCL
  #define PIN_WIRE_SCL          PH4    /* I2C2_SCL (AF4) */
#endif

// Timer Definitions
// Use TIM6/TIM7 when possible as servo and tone don't need GPIO output pin
#ifndef TIMER_TONE
  #define TIMER_TONE            TIM6
#endif
#ifndef TIMER_SERVO
  #define TIMER_SERVO           TIM7
#endif

// UART Definitions
// UART4 on JunctionLink expansion connector (PH13=TX, PH14=RX, AF8)
// When USB CDC is selected in Arduino IDE, 'Serial' maps to USB and these
// pins become Serial1 (hardware UART4).
#ifndef SERIAL_UART_INSTANCE
  #define SERIAL_UART_INSTANCE  4
#endif
#ifndef PIN_SERIAL_RX
  #define PIN_SERIAL_RX         PH14   /* UART4_RX on JunctionLink connector */
#endif
#ifndef PIN_SERIAL_TX
  #define PIN_SERIAL_TX         PH13   /* UART4_TX on JunctionLink connector */
#endif

// Extra HAL modules
#if !defined(HAL_DAC_MODULE_DISABLED)
  #define HAL_DAC_MODULE_ENABLED
#endif

#if !defined(HAL_ADC_MODULE_DISABLED)
  #define HAL_ADC_MODULE_ENABLED
#endif

#if !defined(HAL_ETH_MODULE_DISABLED)
  #define HAL_ETH_MODULE_ENABLED
#endif
#if !defined(HAL_QSPI_MODULE_DISABLED)
  #define HAL_QSPI_MODULE_ENABLED
#endif
#if !defined(HAL_SD_MODULE_DISABLED)
  #define HAL_SD_MODULE_ENABLED
#endif

/*----------------------------------------------------------------------------
 *        Arduino objects - C++ only
 *----------------------------------------------------------------------------*/

#ifdef __cplusplus
  // These serial port names are intended to allow libraries and architecture-neutral
  // sketches to automatically default to the correct port name for a particular type
  // of use.  For example, a GPS module would normally connect to SERIAL_PORT_HARDWARE_OPEN,
  // the first hardware serial port whose RX/TX pins are not dedicated to another use.
  //
  // SERIAL_PORT_MONITOR        Port which normally prints to the Arduino Serial Monitor
  //
  // SERIAL_PORT_USBVIRTUAL     Port which is USB virtual serial
  //
  // SERIAL_PORT_LINUXBRIDGE    Port which connects to a Linux system via Bridge library
  //
  // SERIAL_PORT_HARDWARE       Hardware serial port, physical RX & TX pins.
  //
  // SERIAL_PORT_HARDWARE_OPEN  Hardware serial ports which are open for use.  Their RX & TX
  //                            pins are NOT connected to anything by default.
  #ifndef SERIAL_PORT_MONITOR
  #define SERIAL_PORT_MONITOR   Serial
  #endif

  #ifndef SERIAL_PORT_HARDWARE
    #define SERIAL_PORT_HARDWARE  Serial
  #endif
#endif
